# Заполните массив элементами арифметической прогрессии.
# Её первый элемент, разность и количество элементов нужно ввести с клавиатуры.
# Формула для получения n-го члена прогрессии: a(n) = a(1) + (n-1) * d
# Каждое число вводится с новой строки.

def list_create(first, difference, amount):
    sp = []
    for i in range(amount):
        i += 1
        sp.append(first + (i - 1) * difference)
    print(sp)


try:
    while True:
        a1 = int(input('Введите первый элемент списка a1: '))
        d = int(input('Введите разность d: '))
        n = int(input('Введите количество элементов списка n: '))
        list_create(a1, d, n)
        print()
except:
    print('Введены некорректные данные.\nВыход из программы.')
exit()
