# Последовательностью Фибоначчи называется последовательность чисел a(0), a(1), ..., a(n),
# где a(0) = 0, a(1) = 1, a(k) = a(k-1) + a(k-2) (k > 1).
# Требуется найти N-е число Фибоначчи
# Input: 7
# Output: 21

def fib(n):
    if n == -1:
        return 'Нет нулевого элемента в Последовательности Фибоначчи'
    elif n in (0, 1):
        return n
    return fib(n-1) + fib(n-2)


try:
    while True:
        x = int(input("Введите число: ")) - 1
        print(fib(x))
except:
    print('Введены некорректные данные.\nВыход из программы.')
exit()
