# Вы пользуетесь общественным транспортом? Вероятно, вы расплачивались за проезд и получали билет с номером.
# Счастливым билетом называют такой билет с шестизначным номером, где суммапервых трех цифр равна сумме последних трех.
# Т.е. билет с номером 385916 – счастливый, т.к. 3+8+5 = 9+1+6.
# Вам требуется написать программу, которая проверяет счастливость билета.

try:
    while True:
        number = int(input('Введите шестизначный номер билета: '))

        sum = 0
        count = 1
        while number > 0:
            digit = number % 10
            if count > 3:
                sum -= digit
            else:
                sum += digit
            number = number//10
            count += 1
        if sum == 0:
            print('Счастливый билет')
        else:
            print('Обычный билет')
except:
    print('Введены некорректные данные')
exit()
