# Вагоны в электричке пронумерованы натуральными числами начиная с 1.
# При этом иногда вагоны нумеруются от головы поезда, а иногда с хвоста.
# Это зависит от того, в какую сторону едет электричка.
# В каждом вагоне написан его номер.
# Пассажир сел в i-й вагон от головы поезда и обнаружил, что его вагон имеет номер j.
# Он хочет определить, сколько всего вагонов в электричке.
# Напишите программу, которая будет это делать.
# Или сообщать, что без дополнительной информации это сделать невозможно.

try:
    number = int(input('Введите номер вагона, который на нём написан: '))
    count = int(input('Введите фактический номер вагона от головы состава: '))

    if number == count:
        print('Определить количество вагонов невозможно')
    else:
        print(f'Количество вагоновьв составе = {number+count-1}')

except:
    print('Введены некорректные данные')
exit()
