# В школе решили набрать три новых класса и оборудовать кабинеты для них новыми партами.
# За каждой партой может сидеть два учащихся.
# Известно количество учащихся в каждом из трех классов.
# Выведите наименьшее число парт, которое нужно приобрести для них.

import math
try:
    a = int(input('Введите количество учащихся 1-го класса: '))
    b = int(input('Введите количество учащихся 2-го класса: '))
    c = int(input('Введите количество учащихся 3-го класса: '))
    print('--------------------------------------------------')
    sum = a+b+c
    print(f'Общее количество учащихся - {sum}')
    print('--------------------------------------------------')

    # Первый вариант c инструкцией if
    if sum % 2 == 0:
        tables = sum//2
    else:
        tables = (sum+1)//2
    print('Первый вариант вычисления: необходимо парт -', tables)

    # Второй вариант с библиотелой
    print('Второй вариант вычисления: необходимо парт -', math.ceil((a+b+c)/2))

    # Третий вариант без всего
    print('Третий вариант вычисления: необходимо парт -', round((a+b+c)/2))

except:
    print('Введены некорректные данные')
exit()
