# За день машина проезжает n километров.
# Сколько дней нужно, чтобы проехать маршрут длиной m километров?

import math
try:
    speed = int(input('Введите скорость в километриах в день: '))
    distance = int(input('Введите расстояние в километрах: '))
    print('--------------------------------------------------')

    # Первый вариант c инструкцией if
    if distance % speed != 0:
        time = distance//speed + 1
    else:
        time = distance//speed
    print('Первый вариант вычисления:', time)

    # Второй вариант с библиотелой
    print('Второй вариант вычисления:', math.ceil(distance/speed))

    # Третий вариант без всего
    print('Третий вариант вычисления:', (distance+speed-1)//speed)

except:
    print('Введены некорректные данные')
exit()
