# Дано натуральное число.
# Требуется определить, является ли год с данным номером високосным.
# Если год является високосным, то выведите YES, иначе выведите NO.
# В соответствии с григорианским календарем, год является високосным:
# если его номер кратен 4, но не кратен 100, а также если он кратен 400.

try:
    year = int(input('Введите натуральное число: '))
    if year % 4 == 0 and year % 100 != 0 or year % 400 == 0:
        print('Високосный')
    else:
        print('Не високосный')
except:
    print('Введены некорректные данные')
exit()
