# На столе лежат n монеток. Некоторые из них лежат вверх решкой, а некоторые – гербом.
# Определите минимальное число монеток, которые нужно перевернуть,
# чтобы все монетки были повернуты вверх одной и той же стороной.
# Выведите минимальное количество монет, которые нужно перевернуть.

from random import randint

try:
    while True:
        n = int(input('Введите число монеток: '))

        sp = []

        for i in range(n):
            x = randint(0, 1)
            sp.append(x)
        print(sp)

        count0 = 0
        count1 = 0

        for i in range(n):
            if sp[i] == 0:
                count0 += 1
            else:
                count1 += 1
        if count0 < count1:
            print(f'Нужно перевернуть {count0} шт.')
        else:
            print(f'Нужно перевернуть {count1} шт.')
except:
    print('Введены некорректные данные.\n'
          'Выход из программы.')
exit()
