# Петя и Катя – брат и сестра. Петя – студент, а Катя – школьница.
# Петя помогает Кате по математике.
# Он задумывает два натуральных числа X и Y(X, Y≤1000), а Катя должна их отгадать.
# Для этого Петя делает две подсказки.
# Он называет сумму этих чисел S и их произведение P.
# Помогите Кате отгадать задуманные Петей числа.

from math import *

try:
    while True:
        X = int(input('Петя задумал натуральное число X: '))
        Y = int(input('Петя задумал натуральное число Y: '))
        print('--------------------------------------------------')
        print(f'Подсказка: сумма чисел = {X+Y}, произведение = {X*Y}')
        print('--------------------------------------------------')
        Xi = int((X+Y)/2 - sqrt((X+Y)*(X+Y) + 4*(-X*Y))/2)
        Yi = int((X+Y)/2 + sqrt((X+Y)*(X+Y) + 4*(-X*Y))/2)
        print(f'Петя задумал {Xi} и {Yi}')
except:
    print('Введены некорректные данные.\n'
          'Выход из программы.')
exit()
