from json import *

buttons = {
    '#': 'Помощь',
    '1': 'Добавить',
    '2': 'Удалить',
    '3': 'Изменить',
    '7': 'Контакты',
    '8': 'Сохранить',
    '9': 'Выход',
    '0': 'Прерывание'
}

input_text = {
    '1': 'Введите фамилию: ',
    '2': 'Введите имя: ',
    '3': 'Введите отчество: ',
    '4': 'Введите дату рождения: ',
    '5': 'Введите телефон: ',
    '6': 'Введите почту: '
}

try:
    with open('contacts.json', 'r', encoding='utf-8') as lc:
        contacts = load(lc)
except:
    contacts = [
        {'1': 'Иванов',
         '2': 'Иван',
         '3': 'Иванович',
         '4': '01.01.2001',
         '5': ['89001001010',
               '+78001001010'],
         '6': ['ivan@www.net',
               'ivan@www.com']
         },
        {'1': 'Петров',
         '2': 'Петр',
         '3': 'Петрович',
         '4': '02.02.2002',
         '5': ['89002002020',
               '+78002002020'],
         '6': ['pedro@www.net',
               'pedro@www.com']
         },
        {'1': 'Егоров',
         '2': 'Егор',
         '3': 'Егорович',
         '4': '03.03.2003',
         '5': ['89003000330',
               '+78003003030'],
         '6': ['pedro@www.net',
               'pedro@www.com']
         }
    ]
