# В фермерском хозяйстве в Карелии выращивают чернику.
# Она растет на круглой грядке, причем кусты высажены только по окружности.
# Таким образом, у каждого куста есть ровно два соседних.
# Всего на грядке растет N кустов. Эти кусты обладают разной урожайностью,
# поэтому ко времени сбора на них выросло различное число ягод: – на i-ом кусте выросло a(i) ягод.
# В этом фермерском хозяйстве внедрена система автоматического сбора черники.
# Эта система состоит из управляющего модуля и нескольких собирающих модулей.
# Собирающий модуль за один заход, находясь непосредственно перед некоторым кустом,
# собирает ягоды с этого куста и с двух соседних с ним.
# Напишите программу для нахождения максимального числа ягод,
# которое может собрать за один заход собирающий модуль,
# находясь перед некоторым кустом заданной во входном файле грядки.

from os import system
from random import randint
try:
    system('cls')
    while True:
        N = int(input('Введите количество кустов: '))
        lst = [randint(1, 9) for _ in range(N)]
        print(f'Выросло ягод на каждом кусте: {lst}')
        sum = max_sum = 0
        for i in range(-2, len(lst)-2):
            sum = lst[i] + lst[i+1] + lst[i+2]
            if sum > max_sum:
                max_sum = sum
                sum = 0
        print(f'Максимальноe число ягод за один заход: {max_sum}')
        print()
except:
    print('Введены некорректные данные.\nВыход из программы.')
exit()
