# Два различных натуральных числа n и m называются дружественными,
# если сумма делителей числа n # (включая 1, но исключая само n) равна числу m и наоборот.
# Например, 220 и 284 – дружественные числа.
# По данному числу k выведите все пары дружественных чисел, каждое из которых не превосходит k.
# Программа получает на вход одно натуральное число k, не превосходящее 100000.
# Программа должна вывести все пары дружественных чисел, каждое из которых не превосходит k.
# Пары необходимо выводить по одной в строке, разделяя пробелами.
# Каждая пара должна быть выведена только один раз (перестановка чисел новую пару не дает).

def sum_dividers(number):
    res = 1
    for i in range(2, int(number**0.5) + 1):
        if number % i == 0:
            res += i + number // i
    return res


def get_friendly(number):
    for i in range(1, number):
        sum1 = sum_dividers(i)
        sum2 = sum_dividers(sum1)
        if i == sum2 and sum1 != sum2 and i < sum1 and number >= sum1:
            print(i, sum1)


try:
    while True:
        k = int(input('Введите предел: '))
        print('Дружественные числа:')
        get_friendly(k)
        print()
except:
    print('Введены некорректные данные.\nВыход из программы.')
exit()
